In [1]:
import pandas as pd

In [2]:
data={'roll no.':[101,102,103,104,105],'english':[60,62,75,67,58],'Maths':[66,45,67,76,66],'science':[56,76,55,77,59]}
df=pd.DataFrame(data,index=['sumit','mohit','rohan','laxman','shubham'])
df

         roll no.  english  Maths  science
sumit         101       60     66       56
mohit         102       62     45       76
rohan         103       75     67       55
laxman        104       67     76       77
shubham       105       58     66       59

In [3]:
df.loc['sumit']

roll no.    101
english      60
Maths        66
science      56
Name: sumit, dtype: int64

In [4]:
df.loc[['sumit','laxman']] # only show the all the data of sumit and laxman only

        roll no.  english  Maths  science
sumit        101       60     66       56
laxman       104       67     76       77

In [5]:
df.loc[['sumit','laxman'],['Maths']] # show the maths marks of both

        Maths
sumit      66
laxman     76

In [6]:
df.loc['mohit':'laxman'] # show the data b/w the sumit to laxman

        roll no.  english  Maths  science
mohit        102       62     45       76
rohan        103       75     67       55
laxman       104       67     76       77

In [7]:
df.loc['mohit':'laxman','roll no.':'Maths'] # show the data b/w the sumit to laxman as well as subject b/w roll no.to maths

        roll no.  english  Maths
mohit        102       62     45
rohan        103       75     67
laxman       104       67     76

In [8]:
df.loc['mohit':'laxman','english':'science']

        english  Maths  science
mohit        62     45       76
rohan        75     67       55
laxman       67     76       77

In [9]:
#############  iloc function
df # print the original data

         roll no.  english  Maths  science
sumit         101       60     66       56
mohit         102       62     45       76
rohan         103       75     67       55
laxman        104       67     76       77
shubham       105       58     66       59

In [10]:
df.iloc[0]

roll no.    101
english      60
Maths        66
science      56
Name: sumit, dtype: int64

In [11]:
df.iloc[0,1]

60

In [12]:
df.iloc[0,3]

56

In [13]:
df.iloc[0:3]

       roll no.  english  Maths  science
sumit       101       60     66       56
mohit       102       62     45       76
rohan       103       75     67       55

In [14]:
df.iloc[0:3,0:2]

       roll no.  english
sumit       101       60
mohit       102       62
rohan       103       75

In [15]:
df

         roll no.  english  Maths  science
sumit         101       60     66       56
mohit         102       62     45       76
rohan         103       75     67       55
laxman        104       67     76       77
shubham       105       58     66       59

In [16]:
# catcgh all by using ix method

df.iloc[3,[2,3]]

Maths      76
science    77
Name: laxman, dtype: int64

In [17]:
df.ix[3,"english"] #its works with

C:\Users\vijay\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

67

In [18]:
df.ix['sumit']

C:\Users\vijay\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

roll no.    101
english      60
Maths        66
science      56
Name: sumit, dtype: int64

In [19]:
df.ix[3,2]

C:\Users\vijay\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

76

In [20]:
# now replace to 76 to 88

In [21]:
df.ix[3,2]=88

C:\Users\vijay\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [22]:
df

         roll no.  english  Maths  science
sumit         101       60     66       56
mohit         102       62     45       76
rohan         103       75     67       55
laxman        104       67     88       77
shubham       105       58     66       59

In [23]:
df.ix["english","maths"]=22

C:\Users\vijay\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [24]:
#set of multiple